// নাল ক্যারেক্টার কি?
// নাল ক্যারেক্টার হলো একটি বিশেষ
// ক্যারেক্টার যার ASCII ভ্যালু 0।
// এটিকে '\0' দ্বারা প্রকাশ করা হয়।
// এটি C ভাষায় স্ট্রিং-এর টার্মিনেটর
// (terminator) হিসেবে কাজ করে।

// কেন নাল ক্যারেক্টার গুরুত্বপূর্ণ?
// স্ট্রিং টার্মিনেশন: C ভাষায় স্ট্রিং-এর
// শেষ চিহ্নিত করতে '\0' ব্যবহার করা হয়।
// স্ট্রিং ফাংশন: strlen(), printf(),
// strcpy() এর মত ফাংশনগুলো
// '\0' দেখে স্ট্রিং-এর শেষ বোঝে।

#include <stdio.h>
#include <string.h>

int main()
{
    char str1[20] = "Bangladesh";                    // অটোমেটিক '\0' যুক্ত
    char str2[20] = {'D', 'h', 'a', 'k', 'a', '\0'}; // ম্যানুয়ালি '\0' যুক্ত

    printf("str1: %s\n", str1);
    printf("str2: %s\n", str2);

    return 0;
}