// স্ট্রিং হচ্ছে মূলতো ক্যারেক্টার এরে।
// char arr[20]; এরকম।
// এই ক্যারেক্টার টাইপ এরেকে
// স্ট্রিং নাম দেওয়া হয়েছে কারন
// সি প্রোগ্রামিং এ একে আলাদা কিছু
// পাওয়ার দেওয়া হয়েছে।

#include <stdio.h>

int main()

{

    char ar[10]; // ৫ সাইজের ক্যারেক্টার এরে ডিক্লেয়ার করা হয়েছে।

    for (int i = 0; i < 5; i++) // ০ থেকে ৪ পর্যন্ত লুপ চালানো হচ্ছে।

    {

        scanf("%c", &ar[i]); // প্রতিটি ইন্ডেক্সে একটি করে ক্যারেক্টার ইনপুট নেওয়া হচ্ছে %c দিয়ে
    }

    for (int i = 0; i < 5; i++) // লুপ চালিয়ে প্রতিটি ইন্ডেক্সে যেয়ে

    {

        printf("%c", ar[i]); // ক্যারেক্টারটি প্রিন্ট করা হচ্ছে।
    }

    return 0;
}