// প্রবলেম স্টেটমেন্টঃ
// ইনপুটে একটি স্ট্রিং দেওয়া থাকবে।
//  স্ট্রিং এর নাম্বার গুলোর যোগফল
//  প্রিন্ট করতে হবে।

#include <stdio.h>
#include <string.h>
int main()
{
    char a[1000001];
    scanf("%s", a);
    int sum = 0;                        // যোগফল রাখার জন্য ভেরিয়েবল নিয়ে তাতে শুরুতে ০ রাখা হচ্ছে।
    for (int i = 0; i < strlen(a); i++) // লুপ চালানো হচ্ছে স্ট্রিং এর শুরু থেকে শেষ পর্যন্ত
    {
        sum = sum + (a[i] - '0'); // প্রতিটি ডিজিটে যেয়ে সেই ডিজিট থেকে ০ এর আসকি ভেলু বিয়োগ করা হচ্ছে। কারন নাম্বার গুলো আমরা ক্যারেক্টার হিসেবে ইনপুট নিয়েছি।
    }
    printf("%d", sum); // যোগফল প্রিন্ট করছি।
    return 0;
}