#include <stdio.h>
int main()
{
    int n;
    scanf("%d", &n);            // এরে সাইজ ইনপুট নেওয়া হচ্ছে।
    int ar[n];                  // ওই সাইজের এরে ডিক্লেয়ার করা হচ্ছে। 
    for (int i = 0; i < n; i++) // ৫ সাইজের এরে হলে আমরা লুপ চালাতাম i<5 পর্যন্ত। এখন আমাদের সাইজ হচ্ছে n তাই আমরা লুপ চালাচ্ছি i<n পর্যন্ত।
    {
        scanf("%d", &ar[i]); // ইনপুট নিচ্ছি। 
    }
    for (int i = 0; i < n; i++) // প্রথম ইন্ডেক্স থেকে লাস্ট ইন্ডেক্স পর্যন্ত লুপ চালিয়ে প্রিন্ট করা হচ্ছে।
    {
        printf("%d ", ar[i]);
    }
    return 0;
}