// Array হলো একই ধরনের 
// (same data type) 
// একাধিক ডেটা একটি মাত্র ভেরিয়েবলের 
// নামে, মেমোরিতে ধারাবাহিকভাবে 
// (contiguously) সংরক্ষণ করার একটি 
// ডেটা স্ট্রাকচার। প্রতিটি ডেটাকে তার নির্দিষ্ট 
// ইনডেক্স (index) নম্বর 
// ব্যবহার করে সহজে অ্যাক্সেস করা যায়।

// example:

// without array...
// int mark1 = 80;
// int mark2 = 75;
// int mark3 = 90;
// int mark4 = 85;
// int mark5 = 95;

// with array...
// int marks[5] = {80, 75, 90, 85, 95};

//..................................
// int marks[5] = {80, 75, 90, 85, 95};

// printf("%d\n", marks[0]); // 80
// printf("%d\n", marks[2]); // 90
// printf("%d\n", marks[4]); // 95