#include <stdio.h>
int main()
{
    int n;
    scanf("%d", &n);
    int ar[n];
    for (int i = 0; i < n; i++)
    {
        scanf("%d", &ar[i]);
    }
    int i = 0, j = n - 1;
    while (i < j) // লুপটি চলতে থাকে যতক্ষণ না `i` `j` এর চেয়ে কম হয়। এটি নিশ্চিত করে যে লুপটি অ্যারের মাঝখান পর্যন্ত চলে এবং উভয় দিক থেকে উপাদানগুলোকে সঠিকভাবে swap করা হয়।
    {
        int tmp = ar[i]; // এটি একটি int ভেরিয়েবল `tmp` ঘোষণা করে এবং `ar[i]` এর মান দিয়ে এটি initialize করে। এই ভেরিয়েবলটি সাময়িকভাবে `ar[i]` এর মান ধরে রাখে যাতে আমরা পরবর্তীতে `ar[j]` এর মান `ar[i]` তে স্থানান্তর করতে পারি।
        ar[i] = ar[j];   // এটি `ar[i]` এর মানকে `ar[j]` এর মান দিয়ে প্রতিস্থাপন করে।
        ar[j] = tmp;     // এটি `ar[j]` এর মানকে `tmp` ভেরিয়েবলের মান দিয়ে প্রতিস্থাপন করে, যা আগে `ar[i]` এর মান ধরে রেখেছিল।
        i++;             // এটি `i` এর মান 1 বাড়িয়ে দেয়।
        j--;             // এটি `j` এর মান 1 কমিয়ে দেয়।
    }
    for (int i = 0; i < n; i++)
    {
        printf("%d ", ar[i]);
    }
    return 0;
}