#include <stdio.h>
int main()
{
    int n;
    scanf("%d", &n); // ইনপুট নিচ্ছি
    int a;
    int even = 0, odd = 0, pos = 0, neg = 0; // কাউন্ট করার জন্য ৪টা ভেরিয়েবল নিচ্ছি। শুরুতে সবগুলো ০
    for (int i = 1; i <= n; i = i + 1)       // লুপ চালাচ্ছি
    {
        scanf("%d", &a); // প্রতিবার একটা করে সংখ্যা ইনপুট নিচ্ছি
        if (a % 2 == 0)  // চেক করে দেখছি সংখ্যাটি জোড় কিনা
        {
            even++; // জোড় হলে জোড়ের কাউন্ট এর মান ১ বাড়িয়ে দিচ্ছি
        }
        else
        {
            odd++; // জোড় না হলে বিজোড়ের কাউন্ট এর মান ১ বাড়িয়ে দিচ্ছি
        }

        if (a > 0) // চেক করে দেখছি সংখ্যাটি পজিটিভ অর্থাৎ ০ এর থেকে বড় কিনা
        {
            pos++; // পজিটিভ হলে পজিটিভের কাউন্ট এর মান ১ বাড়িয়ে দিচ্ছি
        }
        else if (a < 0) // চেক করে দেখছি সংখ্যাটি নেগেটিভ অর্থাৎ ০ এর থেকে ছোট কিনা
        {
            neg++; // নেগেটিভ হলে নেগেটিভের কাউন্ট এর মান ১ বাড়িয়ে দিচ্ছি
        }
    }
    printf("Even: %d\nOdd: %d\nPositive: %d\nNegative: %d\n", even, odd, pos, neg);
    return 0;
}