#include <stdio.h>
int main()
{
    int n;
    while (scanf("%d", &n) != EOF) // যতক্ষন না ইনপুটের ফাইল শেষ হচ্ছে ততক্ষন লুপ চলবে এবং ইনপুট নিবে
    {
        if (n == 1999) // যদি পাসওয়ার্ডটি কারেক্ট হয়
        {
            printf("Correct\n"); // তাহলে কারেক্ট প্রিন্ট করা হচ্ছে
            break;               // এবং লুপ থামিয়ে প্রোগ্রাম টারমিনেট করে দেওয়া হচ্ছে
        }
        else // কারেক্ট না হলে
        {
            printf("Wrong\n"); // wrong প্রিন্ট করা হচ্ছে
        }
    return 0;
    }
}